{
  "success": true,
  "video_file": "../media/videos/tiktok__Lugares_IMPOSSÍVEIS_na_Terra__20250731_153304.mp4",
  "size_mb": 7.6037445068359375,
  "duration": 119.688,
  "images_count": 5,
  "roteiro": {
    "titulo": "🤯 Lugares IMPOSSÍVEIS na Terra 🌎 #curiosidades",
    "hook": "Achou que já tinha visto de tudo? Prepare-se para conhecer lugares que desafiam a lógica!",
    "roteiro_completo": "[Cena 1: Vídeo acelerado de paisagens surreais, tipo Salar de Uyuni ou Monte Roraima (0-3s)]\nNarração: Achou que já tinha visto de tudo? Prepare-se para conhecer lugares que desafiam a lógica!\n\n[Cena 2: Foto do Salar de Uyuni refletido (3-8s)]\nNarração: Começando pelo Salar de Uyuni, na Bolívia. O maior deserto de sal do mundo, que na época das chuvas se transforma num espelho gigante, refletindo o céu de forma surreal. Parece outro planeta!\n\n[Cena 3: Transição rápida para foto do Monte Roraima (8-13s)]\nNarração: Que tal um lugar com cachoeiras que caem das nuvens? O Monte Roraima, na fronteira entre Brasil, Venezuela e Guiana, parece um cenário de filme de ficção científica, com formações rochosas únicas e espécies de plantas que não existem em nenhum outro lugar.\n\n[Cena 4: Transição rápida para foto da Caverna dos Cristais (13-18s)]\nNarração: Já imaginou cristais gigantes? Na Caverna dos Cristais, no México, você encontra exatamente isso! Cristais de selenita maiores que um ônibus, um ambiente tão extremo que exige equipamentos especiais para ser explorado.\n\n[Cena 5: Transição rápida para vídeo do Lago Natron (18-25s)]\nNarração: E o Lago Natron, na Tanzânia? Com sua alta alcalinidade, ele petrifica animais que se aventuram em suas águas. Parece assustador, mas é incrivelmente belo e misterioso.\n\n[Cena 6: Transição rápida para foto da Depressão de Danakil (25-35s)]\nNarração: Falando em extremo, prepare-se para a Depressão de Danakil, na Etiópia. Um dos lugares mais quentes e inóspitos da Terra, com paisagens vulcânicas, lagos de ácido e fontes termais coloridas. Parece cenário de filme apocalíptico!\n\n[Cena 7: Transição rápida para foto de Socotra (35-45s)]\nNarração: Por último, mas não menos impressionante, a Ilha de Socotra, no Iêmen. Com sua flora e fauna únicas, parece um planeta alienígena. Árvores com formato de guarda-chuva e espécies bizarras fazem desse lugar um verdadeiro paraíso perdido.\n\n[Cena 8: Montagem rápida de todos os lugares mencionados, com música animada (45-50s)]\nNarração: E aí, qual desses lugares te impressionou mais?\n\n[Cena 9: Tela final com texto: “Comenta qual lugar você visitaria!” (50-55s)]\nNarração: Comenta qual lugar você visitaria! E não esquece de compartilhar esse vídeo com seus amigos e seguir o canal para mais curiosidades incríveis sobre o nosso planeta.\n\n[Cena 10: Tela com hashtags e nome do criador (55-60s)]",
    "hashtags": [
      "#viral",
      "#ciencia",
      "#curiosidades",
      "#aprendanotiktok",
      "#lugaresincriveis",
      "#viagem",
      "#terra",
      "#impossível"
    ],
    "categoria": "ciencia",
    "topico_original": "lugares impossíveis na Terra",
    "timestamp": "2025-07-31T15:32:11.149747"
  },
  "status": "Aguardando Revisão"
}