{
  "success": true,
  "video_file": "../media/videos/tiktok__Invenções_INSANAS_Que_Mudaram_20250801_011819.mp4",
  "size_mb": 7.116065979003906,
  "duration": 102.288,
  "images_count": 5,
  "roteiro": {
    "titulo": "🤯 Invenções INSANAS Que Mudaram TUDO! 💡",
    "hook": "Imagine um mundo sem internet... IMPOSSÍVEL, né?",
    "roteiro_completo": "[Cena 1: Vídeo acelerado de várias tecnologias modernas, como smartphones, carros, aviões (0-3s)]\nNarração: Imagine um mundo sem internet... IMPOSSÍVEL, né? Mas houve um tempo em que essas maravilhas tecnológicas não existiam. Prepare-se para explodir sua mente com as invenções que MUDARAM TUDO!\n\n[Cena 2: Foto antiga de Gutenberg e uma prensa de impressão (3-8s)]\nNarração: Começando com a prensa de Gutenberg! Antes dela, livros eram escritos à mão, caríssimos e inacessíveis. A prensa democratizou o conhecimento, BOOM! Revolução cultural!\n\n[Cena 3: Ilustração da lâmpada se acendendo e fotos de cidades iluminadas à noite (8-15s)]\nNarração:  Aí chega Thomas Edison com a lâmpada incandescente. Adeus, velas! Olá, noites iluminadas! A produtividade explodiu, a vida noturna nasceu. Pense no impacto!\n\n[Cena 4: Animação de bactérias e representação da penicilina (15-22s)]\nNarração: E a penicilina? Alexander Fleming, o herói!  Infecções que antes eram mortais, agora tinham cura!  A expectativa de vida deu um salto gigantesco.\n\n[Cena 5: Transição rápida entre imagens de diferentes meios de transporte: cavalo, carroça, carro, avião (22-30s)]\nNarração:  Do cavalo para o carro, do carro para o avião... a roda e o motor de combustão interna revolucionaram o transporte, conectando o mundo como nunca antes!\n\n[Cena 6: Representação visual da internet conectando o mundo (30-38s)]\nNarração: E chegamos na era digital! A internet conectou bilhões de pessoas, dando acesso à informação, comunicação instantânea e... gatinhos fofos! 😻\n\n[Cena 7: Montagem rápida de memes e vídeos virais (38-45s)]\nNarração: Sem ela, este vídeo não existiria! Imagina só?!\n\n[Cena 8: Imagens de pessoas usando smartphones e interagindo em redes sociais (45-50s)]\nNarração:  A tecnologia continua avançando a cada dia.  O que será que o futuro nos reserva?\n\n[Cena 9: Fundo chamativo com texto: Comenta qual invenção você acha mais importante! (50-55s)]\nNarração: Qual dessas invenções você acha a mais impactante? Conta pra gente nos comentários!\n\n[Cena 10: Tela final com ícones de curtir, comentar, compartilhar e seguir (55-60s)]\nNarração:  E não esquece de curtir, compartilhar com seus amigos e seguir para mais conteúdo incrível como este!",
    "hashtags": [
      "#viral",
      "#invencoes",
      "#tecnologia",
      "#historia",
      "#aprendanotiktok"
    ],
    "categoria": "educacao",
    "topico_original": "invenções que mudaram tudo",
    "timestamp": "2025-08-01T01:17:30.105656"
  },
  "status": "Aguardando Revisão"
}